
#学习目标:学习Python的基本数据类型、运算符、条件语句、循环语句等
"""
# 循环语句：如果你需要重复执行代码块，可以使用for和while循环。例如：for i in range(5): print(i)。

# 函数：如果你需要重复使用相同的代码块，可以定义一个函数。例如：def greet(name): print("Hello, " + name)。

##数据类型：Python中有多种数据类型，包括数字、字符串、列表、元组、集合和字典。以下是一些常见的数据类型和用法：
# 数字：包括整数、浮点数和复数。例如：x = 10, y = 3.14, z = 2 + 3j。

# 字符串：由字符组成的序列。可以使用单引号或双引号来表示。例如：name = “John”。

# 列表：有序的值序列。可以使用方括号括起来，值之间用逗号分隔。例如：my_list = [1, 2, 3]。

# 元组：有序的值序列，但不能修改。可以使用圆括号括起来，值之间用逗号分隔。例如：my_tuple = (1, 2, 3)。

# 集合：一个无序的集合。可以使用大括号括起来，值之间用逗号分隔。例如：my_set = {1, 2, 3}。

# 字典：键值对的集合。可以使用大括号括起来，键和值之间用冒号分隔，键值对之间用逗号分隔。
  例如：my_dict = {“name”: “John”, “age”: 30}。

"""